'''
    ADD
'''
msg_addwords_main_text = """📝 До <b>вашого списку</b> слів групи <code>"{0}"</code> додано <b>нові слова</b>, які уникають фільтрацію ботом. 🚫 Ось вони: <i>{1}</i>."""
msg_addwords_incorrect_1 = """❗️ <b>Помилка:</b> слова не передано для додавання в список.

✍️ <b>Введіть</b> /{0} <code>слово#1, слово#2</code> <i>(перераховуючи через кому)</i>."""
msg_addwords_incorrect_2 = """❗️ <b>Помилка:</b> слова не правильний формат команди.

✍️ <b>Введіть</b> /{0} <code>слово#1, слово#2</code> <i>(перераховуючи через кому)</i>."""
msg_addwords_to_confirm_for_own_1 = """📬 <b>Нове повідомлення</b>.

👥 Група <code>"{0}"</code> додала до свого списку слова, які <b>уникають фільтрацію</b>. Можливо, тут є <i>слова</i>, які можна було б додати до <b>ГЛОБАЛЬНОГО</b> списку. 🌐"""
msg_addwords_to_confirm_for_own_2 = """🆕 До <b>ГЛОБАЛЬНОГО</b> списку додано нові слова: <i>{0}</i>."""


'''
    DELETE
'''
msg_delete_main_text = """🔍 Список слів, які <b>уникають фільтрації</b> в групі <code>"{0}"</code>.

👉 Для <b>видалення слова</b> натисніть на нього, і воно буде видалено!"""
msg_delete_add_word_again = """🗑 <b>Список порожній</b>.

📌 Щоб <b>додати слова</b>, які бот буде <b>уникати фільтрації в вашій групі</b>: натисніть команду /addwords слово#1, слово#2 <i>(перераховуючи їх через кому)</i>."""
msg_delete_for_owner = """🗂 Список <b>ГЛОБАЛЬНИХ</b> слів, які <b>уникають фільтрації</b> в усіх групах.

🫴🏻 Для <b>вилучення слова</b> з глобального списку <code>натисніть</code> на нього, і воно буде видалено! 🚫"""


'''
    LANGUAGE FILTER
'''
msg_language_filter = """❗️ Це речення <b>містить</b> російські слова, а саме: <i><b>{0}</b></i>. 

🤔 Можливо, ви мали на увазі ці слова: <i><b>{1}</b></i>.

📌 <i>Дотримуйтесь правил чату групи та спілкуйтеся україномовному середовищі.</i>"""

'''
    #SWEAR CONTROL
'''
swear_control_text_main = """🚫 Ви використали неприпустимі слова. Будь ласка, утримуйтесь від використання нецензурної лексики, таких як: <i><b>{0}</b></i>."""